Revit 2026 API

# FaceHasRegions Property

---

Identifies if the face contains regions (which can be created, for example, by the Split Face command).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasRegions { get; }
```
```vb
Public ReadOnly Property HasRegions As Boolean
	Get
```
```cpp
public:
property bool HasRegions {
	bool get ();
}
```
```fsharp
member HasRegions : bool with get
```

#### Property Value

Boolean

If this is true, use GetRegions to get access to the specific Faces which make up the regions.

#### Reference

Face Class

Autodesk.Revit.DB Namespace